#  Function

## 1: Arithmetic Function

In [13]:
x=3
y=4
x+y

7

## Addition using User-Define Function

In [14]:
def add(a,b):
    return a+b
print(add(4,5))

9

In [20]:
def add(a,b,c=None):
    if (c==None):
        return a+b
    else:
        return a+b+c
    
print(add(2,4))
print(add(4,5,6))

6
15

## 2: List and Tuple

In [21]:
# Tuples are an immutable data structure (cannot be altered).

In [22]:
a= (1,'a',2,'b')
type(a)

tuple

In [35]:
a= [1,'a',2,'b']
type(a)

list

In [36]:
##Use append to append an object to a list.

a.append('c')
print(a)

[1, 'a', 2, 'b', 'c']

In [37]:
#Use + to concatenate lists.
[2,4]+[5,6]

[2, 4, 5, 6]

In [38]:
#Use * to repeat lists.
[3]*4

[3, 3, 3, 3]

In [39]:
#Slicing a atring
x = 'we are learning python'
print(x[0]) #first character
print(x[0:1]) #first character, but we have explicitly set the end character
print(x[0:2]) #first two characters

w
w
we

In [40]:
x[-1]

'n'

In [41]:
x[-4:-2]

'th'

In [42]:
x[:3]

'we '

In [43]:
x[3:]

'are learning python'

In [44]:
firstname = 'vivek'
lastname = 'singh'

print(firstname + ' ' + lastname)
print(firstname*3)
print('vivek' in firstname)

vivek singh
vivekvivekvivek
True

In [45]:
firstname = 'vivek is trying to teach python'.split(' ')[0] # [0] selects the first element of the list
lastname = 'vivek is trying to teach python'.split(' ')[-1] # [-1] selects the last element of the list
print(firstname)
print(lastname)

vivek
python

In [47]:
'vivek' + str(7594)

'vivek7594'

## 3:Dictionaries and keys

In [48]:
x = {'vivek': 'vivek.blr', 'murli': 'murli.rbl'}
x['vivek'] # Retrieve a value by using the indexing operator

'vivek.blr'

## 4: Reading and Writing CSV files

In [50]:
import csv
#Python in its definition allows to handle precision of floating point numbers in several ways using different functions
%precision 2

with open('mpg.csv') as csvfile:
    mpg = list(csv.DictReader(csvfile))
    
mpg[:3]

[OrderedDict([('', '1'),
              ('manufacturer', 'audi'),
              ('model', 'a4'),
              ('displ', '1.8'),
              ('year', '1999'),
              ('cyl', '4'),
              ('trans', 'auto(l5)'),
              ('drv', 'f'),
              ('cty', '18'),
              ('hwy', '29'),
              ('fl', 'p'),
              ('class', 'compact')]),
 OrderedDict([('', '2'),
              ('manufacturer', 'audi'),
              ('model', 'a4'),
              ('displ', '1.8'),
              ('year', '1999'),
              ('cyl', '4'),
              ('trans', 'manual(m5)'),
              ('drv', 'f'),
              ('cty', '21'),
              ('hwy', '29'),
              ('fl', 'p'),
              ('class', 'compact')]),
 OrderedDict([('', '3'),
              ('manufacturer', 'audi'),
              ('model', 'a4'),
              ('displ', '2'),
              ('year', '2008'),
              ('cyl', '4'),
              ('trans', 'manual(m6)'),
              ('drv', 'f'),
              ('cty', '20'),
              ('hwy', '31'),
              ('fl', 'p'),
              ('class', 'compact')])]

In [51]:
len(mpg)

234

In [52]:
mpg[0].keys()

odict_keys(['', 'manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty', 'hwy', 'fl', 'class'])

In [53]:
## Average cty fuel economy across all cars
sum(float(d['cty']) for d in mpg) / len(mpg)

16.86

In [54]:
## Average hwy fuel economy across all cars
sum(float(d['hwy'])for d in mpg)/len(mpg)

23.44

In [55]:
##the unique values for the number of cylinders
cylinders = set(d['cyl'] for d in mpg)
cylinders

{'4', '5', '6', '8'}

## 5:Dates and Times

In [56]:
import datetime as dt
import time as tm

In [57]:
tm.time()

1543567870.77

In [58]:
#Convert the timestamp to datetime
dtnow=dt.datetime.fromtimestamp(tm.time())
dtnow

datetime.datetime(2018, 11, 30, 14, 22, 48, 631560)

In [60]:
dtnow.year, dtnow.month, dtnow.day, dtnow.hour, dtnow.minute, dtnow.second

(2018, 11, 30, 14, 22, 48)

In [62]:
my_function = lambda a, b, c : a + b *c

In [63]:
my_function(1, 2, 3)

7

In [64]:
# positive even number
my_list = []
for number in range(0, 100):
    if number % 2 == 0:
        my_list.append(number)
my_list

[0,
 2,
 4,
 6,
 8,
 10,
 12,
 14,
 16,
 18,
 20,
 22,
 24,
 26,
 28,
 30,
 32,
 34,
 36,
 38,
 40,
 42,
 44,
 46,
 48,
 50,
 52,
 54,
 56,
 58,
 60,
 62,
 64,
 66,
 68,
 70,
 72,
 74,
 76,
 78,
 80,
 82,
 84,
 86,
 88,
 90,
 92,
 94,
 96,
 98]

In [1]:
class Person:
    department = 'work_place' #a class variable

    def set_name(self, new_name): #a method
        self.name = new_name
    def set_location(self, new_location):
        self.location = new_location

In [2]:
person = Person()
person.set_name('vivek singh')
person.set_location('AGB layout, SBC, India')
print('{} live in {} and works in the department {}'.format(person.name, person.location, person.department))

Christopher Brooks live in Ann Arbor, MI, USA and works in the department School of Information

In [22]:
store1 = [10.00, 11.00, 12.34, 2.34]
store2 = [9.00, 11.10, 12.34, 2.01]
cheapest = map(min, store1, store2)
cheapest

In [23]:
for item in cheapest:
    print(item)

9.0
11.0
12.34
2.01

In [3]:
store1 = [10.00, 11.00, 12.34, 2.34]
store2 = [9.00, 11.10, 12.34, 2.01]
cheapest = map(min, store1, store2)
cheapest

In [4]:
for item in cheapest:
    print(item)

9.0
11.0
12.34
2.01

## Lambda and List Comprehensions

In [24]:
# lambda is a function which do calculations but need to store in some variable
lambda a,b,c:a+b

In [25]:
x=lambda a,b,c:a+b

In [28]:
x(4,5,3)

9

In [29]:
my_list=[]
for number in range(0, 100):
    if number%2==0:
        my_list.append(number)
my_list

[0,
 2,
 4,
 6,
 8,
 10,
 12,
 14,
 16,
 18,
 20,
 22,
 24,
 26,
 28,
 30,
 32,
 34,
 36,
 38,
 40,
 42,
 44,
 46,
 48,
 50,
 52,
 54,
 56,
 58,
 60,
 62,
 64,
 66,
 68,
 70,
 72,
 74,
 76,
 78,
 80,
 82,
 84,
 86,
 88,
 90,
 92,
 94,
 96,
 98]

## The Series Data Structure

In [31]:
import pandas as pd
pd.Series?

In [33]:
animals=['tiger','bear','moose']
pd.Series(animals)

0    tiger
1     bear
2    moose
dtype: object

In [34]:
numbers=[1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [35]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [36]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [37]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [38]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

## Querying a Series

In [39]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [40]:
s.iloc[3]

'South Korea'

In [41]:
s.loc['Golf']

'Scotland'

In [44]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [45]:
total = 0
for item in s:
    total+=item
print(total)

324.0

In [46]:
import numpy as np

total = np.sum(s)
print(total)

324.0

In [47]:
#this creates a big series of random numbers
s = pd.Series(np.random.randint(0,1000,10000))
s.head()

0    994
1    489
2    968
3    325
4    353
dtype: int32

In [48]:
len(s)

10000

In [49]:
%%timeit -n 100
summary = 0
for item in s:
    summary+=item

710 µs ± 76.5 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [50]:
s = pd.Series([1, 2, 3])
s.loc['Animal'] = 'Bears'
s

0             1
1             2
2             3
Animal    Bears
dtype: object

In [51]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)

In [52]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [53]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [54]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [55]:
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

## The DataFrame Data Structure

In [56]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [58]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [59]:

type(df.loc['Store 1'])

pandas.core.frame.DataFrame

In [60]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [61]:
#transpose
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [62]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [63]:
df.loc[:,['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0